Tekla.Structures.Analysis.AnalysisNodeLink.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisNodeLink class.

Tekla.Structures.Analysis.AnalysisNodeLink.IsUserConnectivity
Indicates whether the analysis node has a user defined connectivity.

Tekla.Structures.Analysis.AnalysisNodeLink.InsertInstance
Insert node link

Tekla.Structures.Analysis.AnalysisNodeLink.SelectInstance
Select node link

Tekla.Structures.Analysis.AnalysisNodeLink.ModifyInstance
Modify node link

Tekla.Structures.Analysis.AnalysisNodeLink.DeleteInstance
Delete node link